ЧартерEDT.Расширение1/src/DataProcessors/ИзменениеНаименованияНомеров/ИзменениеНаименованияНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИзменениеНаименованияНомеров</name>
</mdclass:DataProcessor>

ЧартерEDT.Расширение1/src/Documents/ChangeRoom/ChangeRoom.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fedfdb53-97f4-484f-a6f8-b777d9d19086">
  <name>ChangeRoom</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НомерКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c38b0648-9193-4cc0-a8c6-1936eeb10fa3">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ffc7558-f2aa-4de2-8518-2142016a59d0">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e74cc2dd-56b2-4416-8abf-f8cf8bcaa8a8">
    <name>IsVirtual</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1d21db74-604d-453c-bc59-c7afc99dc32a">
    <name>OperationEndDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a96ccc6f-dd78-41a4-9afc-82352d8d82aa">
    <name>RoomGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9996f2b9-a3a6-4f49-ba77-3d2a8059647c">
    <name>RoomNumber</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="238c8086-0d24-4d54-84dc-c83ba09c8054">
    <name>NumberOfBedsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de233e21-9fe0-4a41-bb29-6f8dcf4a5775">
    <name>NumberOfPersonsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41bd7a4a-793e-4300-ad93-c4e11f829bf2">
    <name>SortCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="40d3d3bb-3108-4c06-a493-8593748439b6">
    <name>Remarks</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f6a3772-86d8-4576-9afc-214fbe57b035">
    <name>Author</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eff1623-c47a-49bb-8067-75689b367aba">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/Catalogs/Rooms/Rooms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="314d26a8-7b4b-4a8f-90f7-e5901b9381ea">
  <name>Rooms</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Hotels</owners>
  <attributes extendedConfigurationObject="a57f8f48-059d-442a-9491-cdc5fe57e45b">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8715f502-5359-402e-9bcb-008c3ac6ecc7">
    <name>Floor</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="86ac6557-8587-4554-8272-a7a8e5194345">
    <name>OperationStartDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dc2e1169-d45a-4927-8360-1adb53f6119a">
    <name>OperationEndDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9da496fa-b0c2-4bb7-9c65-b6ce43a40722">
    <name>RoomStatus</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="976d56b1-2420-49f6-b2d8-05b215f4a3c3">
    <name>Remarks</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de617821-cc50-4a40-b9d0-7c9c53c5e07d">
    <name>HasRoomBlocks</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fa13aab3-cdc2-4e72-be78-a83a43abd88b">
    <name>RoomPropertiesCodes</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9742426-cadd-4a73-8d47-dea4f353c876">
    <name>SortCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5e5f16e9-a395-459a-b4b7-09f0f0005b2a">
    <name>StopSale</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89530b4a-e2c7-4c69-9616-c63dce4c0a6d">
    <name>IsVirtual</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed27ecd9-a7e3-4422-b236-9e112db969fa">
    <name>RoomSection</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e95d58a5-45e1-413c-b458-67c736970038">
    <name>NumberOfBedsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ac03c227-7b61-483b-833a-9e9700d4a4db">
    <name>NumberOfPersonsPerRoom</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЭтажностьДома</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКвартир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a6060fd4-5e1c-4f32-b687-486913ddcaf0">
    <name>DoNotShowRoomGuestTotals</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e87a3db0-f47d-4027-ae92-0a9a3e34e91b">
    <name>Company</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a2783da-61d3-4b79-87e6-fb429a3feae1">
    <name>BoardPlace</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37f7da23-9fad-4f81-bb85-ae914ea272a0">
    <name>DoorLockSystemAuthorization</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25f2ec45-d88a-42d1-a46b-3c1a8a05e17a">
    <name>LockCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="09d8465f-94de-4963-87cc-b57586898ce1">
    <name>SecurityCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НеУчитыватьВСправке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомнаты</name>
    <type>
      <types>EnumRef.ТипыКомнат</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="47342c37-8da9-4a91-a2fc-5d04eeee7230">
    <name>StopSalePeriods</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fc750c82-d214-4e8f-8379-10dcdb2e31c5">
      <name>PeriodTo</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="86efabe1-76f6-4096-94f1-29eb1b2a34de">
      <name>StopSale</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0d3efb3e-a9e2-4cc5-bdc6-94e89b62b17c">
      <name>PeriodFrom</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="65003611-cf6e-497e-9516-2176ebb38971">
      <name>Remarks</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="df061335-7a23-4b50-9292-9f2646bbc5d2">
    <name>ConnectedRooms</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3e38c35a-7724-46a5-9583-3ebcc2162872">
      <name>Room</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="27602b33-024e-4561-9354-2459bcd472cc">
      <name>RoomType</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/DataProcessors/ИзменениеНаименованияНомеров/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Rooms.Ссылка КАК Room,
	|	Rooms.Наименование КАК Наименование,
	|	Rooms.НомерКвартиры КАК НомерКвартиры
	|ИЗ
	|	Справочник.Rooms КАК Rooms
	|ГДЕ
	|	Rooms.Родитель = &Дом";
	
	Запрос.УстановитьПараметр("Дом", Дом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаименованиеНомера = Выборка.Наименование;
		НомерКвартиры = Выборка.НомерКвартиры;
		
		ВхождениеПервойСкобки = СтрНайти(НаименованиеНомера,"(");
		
		Если ВхождениеПервойСкобки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерДома = Лев(НаименованиеНомера, ВхождениеПервойСкобки -1); 
		
		ВхождениеКомнаты = СтрНайти(НаименованиеНомера,"комн.");
		
		Если ВхождениеКомнаты = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерКомнаты = Прав(НаименованиеНомера, СтрДлина(НаименованиеНомера) - (ВхождениеКомнаты + 4));
		
		НовоеНаименованиеНомера = НомерДома + "-" + НомерКвартиры + "/"+НомерКомнаты; 
		
		Если НовоеНаименованиеНомера<> НаименованиеНомера Тогда
			ДокументОбъект = Документы.ChangeRoom.СоздатьДокумент();
			ДокументОбъект.Room = Выборка.Room;
			
			ДокументОбъект.pmFillAttributesWithDefaultValues();
			
			ДокументОбъект.RoomNumber = НовоеНаименованиеНомера;
			
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Выполнено");	
КонецПроцедуры
